app/controllers/publications_controller.rb

    def index
      @publications = Publication.all
---
SELECT "publications".* FROM "publications"

    def create
      @publication = Publication.new(publication_params)
      if params[:back]
        render :new
      else
        if @publication.save
---
INSERT INTO "publications" ("content") VALUES ($1) RETURNING "id"  [["content", "hhdhhhvfhjsf"]]

    def destroy
      @publication.destroy
---
DELETE FROM "publications" WHERE "publications"."id" = $1  [["id", 1]]