app/controllers/publications_controller.rb

    def index
      @publications = Post.all
---
SELECT "posts".* FROM "posts"

    def set_publication
      @publication = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]